In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Read the data**

In [2]:
file_path=r"C:\Users\omkar\OneDrive\Documents\Data science\Naresh IT\Naresh IT\Datafiles\\Visadataset.csv"
pd.read_csv(file_path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [3]:
file_path=r"C:\Users\omkar\OneDrive\Documents\Data science\Naresh IT\Naresh IT\Datafiles\\bank.csv"
pd.read_csv(file_path,sep=';')

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

**Now onwards everyday I will teach on Visa dataset after class you need on bank dataset**

**in the class we will do experiment**

**after the class you need to create your own notes on visadataset**

- practice notes

- clear notes

- assignment on bank data

In [4]:
file_path=r"C:\Users\omkar\OneDrive\Documents\Data science\Naresh IT\Naresh IT\Datafiles\\Visadataset.csv"
visa_df=pd.read_csv(file_path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

- type

- len

- shape

- size

- head

- tail

- isnull

- dtypes

- info

- take

- iloc

- loc

$type$

In [5]:
type(visa_df)

pandas.core.frame.DataFrame

$len$

In [6]:
len(visa_df) # number of rows

25480

$shape$

In [7]:
visa_df.shape

(25480, 12)

In [8]:
print("the number of rows are:",visa_df.shape[0])
print("the number of columns are:",visa_df.shape[1])

the number of rows are: 25480
the number of columns are: 12

$size$

In [9]:
visa_df.size
# size gives number of values in entire data set

305760

In [10]:
25480*12

305760

In [11]:
visa_df.shape[0]*visa_df.shape[1]

305760

$columns$

In [12]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [13]:
len(visa_df.columns)

12

In [14]:
#visa_df.columns.index('no_of_employees')

In [15]:
list(visa_df.columns).index('no_of_employees')

5

$head$

- top 5 rows

In [16]:
visa_df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

$tail$

In [17]:
visa_df.tail()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

$dtypes$

In [18]:
visa_df.dtypes
# object : categorical

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [19]:
type(visa_df.dtypes)

pandas.core.series.Series

- dataframe has rows and columns

- dataframe we can see column names

- but series is given as two vertical values

- there is no heading

- it is representation of key:value pair

**Always learn how to display a dataframe using series**

In [20]:
dtypes=visa_df.dtypes
dtypes.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [21]:
dtypes.values

array([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'),
       dtype('O'), dtype('O'), dtype('O')], dtype=object)

**task-1: Extract numerical and categorical columns seperately**

In [22]:
for i,j in dtypes.items():
    if j=='object':
        print(i)

cat_cols=[i for i,j in dtypes.items() if j=='object']
len(cat_cols)

case_id
continent
education_of_employee
has_job_experience
requires_job_training
region_of_employment
unit_of_wage
full_time_position
case_status

9

In [23]:
num_cols=[i for i,j in dtypes.items() if j!='object']
len(num_cols)

3

**select dtypes**

In [24]:
visa_df.select_dtypes(include='object').columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [25]:
visa_df.select_dtypes(exclude='object').columns

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

In [26]:
# all the methods backend python logic
# a good developer first focus how to achive by using basich python logic
# later will also remeber methods

**method-1**

In [27]:
dtypes=visa_df.dtypes
keys=dtypes.keys()
values=dtypes.values
df=pd.DataFrame(zip(keys,values),
            columns=['Colum name','Data type'])
df.to_csv('column_datatype.csv',index=False)

**method-2**

In [28]:
dtypes.items()

In [29]:
dtypes=visa_df.dtypes
pd.DataFrame(dtypes.items(),columns=['Colum name','Data type'])

               Colum name Data type
0                 case_id    object
1               continent    object
2   education_of_employee    object
3      has_job_experience    object
4   requires_job_training    object
5         no_of_employees     int64
6             yr_of_estab     int64
7    region_of_employment    object
8         prevailing_wage   float64
9            unit_of_wage    object
10     full_time_position    object
11            case_status    object

In [30]:
pd.DataFrame(dtypes)

                             0
case_id                 object
continent               object
education_of_employee   object
has_job_experience      object
requires_job_training   object
no_of_employees          int64
yr_of_estab              int64
region_of_employment    object
prevailing_wage        float64
unit_of_wage            object
full_time_position      object
case_status             object

In [31]:
dtypes.index

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [32]:
dtypes.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

**method-3**

In [33]:
dict(visa_df.dtypes)

{'case_id': dtype('O'),
 'continent': dtype('O'),
 'education_of_employee': dtype('O'),
 'has_job_experience': dtype('O'),
 'requires_job_training': dtype('O'),
 'no_of_employees': dtype('int64'),
 'yr_of_estab': dtype('int64'),
 'region_of_employment': dtype('O'),
 'prevailing_wage': dtype('float64'),
 'unit_of_wage': dtype('O'),
 'full_time_position': dtype('O'),
 'case_status': dtype('O')}

In [34]:
val=dict(visa_df.dtypes)
pd.DataFrame(val,index=['A'])

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
A,object,object,object,object,object,int64,int64,object,float64,object,object,object

In [35]:
import pandas as pd
#==================== data=====================
dict1={'names':['saurabh','abdhul','rishi','Nandu'],
      'age':[20,22,24,26],
      'city':['Jaipur','Hyd','Kolkata','Blr']}
pd.DataFrame(dict1)

     names  age     city
0  saurabh   20   Jaipur
1   abdhul   22      Hyd
2    rishi   24  Kolkata
3    Nandu   26      Blr

**isnull**

- is null means we are asking a qn is there any null value available or not

- when we ask a qn to computer the answer either True or False

- True means yes we have a null value

- False means no we do not have a null value

In [36]:
# dataframe name is visa_df
visa_df.isnull()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,False,False,False,False,False,False,False,False,False,False,False,False
25476,False,False,False,False,False,False,False,False,False,False,False,False
25477,False,False,False,False,False,False,False,False,False,False,False,False
25478,False,False,False,False,False,False,False,False,False,False,False,False
25479,False,False,False,False,False,False,False,False,False,False,False,False

In [37]:
visa_df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

**info**

In [38]:
visa_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

- head will give top 5 by default

- tail will give last 5 by default

- how to get specific rows and specific column data

- take

- iloc

- loc

**take**

In [43]:
# case-1: I want to select 100, 200, 300 rows
# first i need to create a list of numbers [100,200,300]
# axis=0 so that it will indicate rows
rows=[100,200,300]
visa_df.take(rows,axis=0)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [40]:
rows=[100,200,300]
visa_df.take(rows,axis=1)
# becuase axis=1 columns
# we have only 12

IndexError: indices are out-of-bounds

In [44]:
columns=[5,8,10]
visa_df.take(columns,axis=1)

       no_of_employees  prevailing_wage full_time_position
0                14513         592.2029                  Y
1                 2412       83425.6500                  Y
2                44444      122996.8600                  Y
3                   98       83434.0300                  Y
4                 1082      149907.3900                  Y
...                ...              ...                ...
25475             2601       77092.5700                  Y
25476             3274      279174.7900                  Y
25477             1121      146298.8500                  N
25478             1918       86154.7700                  Y
25479             3195       70876.9100                  Y

[25480 rows x 3 columns]

- what is the draw back 

- we can not extract specific rows from specific columns using single take operation

- for example 100 200 300 rows from 5 8 10 columns using single take

In [45]:
rows=[100,200,300]
columns=[5,8,10]
visa_df.take(rows,axis=0).take(columns,axis=1)

     no_of_employees  prevailing_wage full_time_position
100             2227         28243.79                  Y
200             3282         74441.11                  Y
300             3268        101371.21                  Y

**iloc**

- dataframe.iloc[rows,columns]

- dataframe.iloc[start:stop:step,start:stop:step]

- dataframe.iloc[rows_list,column_list]

In [47]:
rows=[100,200,300]
columns=[5,8,10]
visa_df.iloc[rows,columns]

     no_of_employees  prevailing_wage full_time_position
100             2227         28243.79                  Y
200             3282         74441.11                  Y
300             3268        101371.21                  Y

In [48]:
visa_df.iloc[100:105,5:10]

,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage
100,2227,2007,Northeast,28243.79,Year
101,334,2007,Midwest,43421.88,Year
102,224,2008,Midwest,80253.78,Year
103,367,1982,West,115235.95,Year
104,306,2003,Northeast,95200.86,Year

In [ ]:
visa_df.iloc[[100,200,300],[5,8,10]]
visa_df.iloc[[100,200,300],5]
visa_df.iloc[[100,200,300],[5]]
visa_df.iloc[:,[5,8,10]]
visa_df.iloc[[100,200,300],:]
visa_df.iloc[100:106,[5,8,10]]
visa_df.iloc[[100,200,300],5:10]
visa_df.iloc[[100,200,300]]

In [49]:
visa_df.iloc[[100,200,300],[5,8,10]]

     no_of_employees  prevailing_wage full_time_position
100             2227         28243.79                  Y
200             3282         74441.11                  Y
300             3268        101371.21                  Y

In [50]:
visa_df.iloc[[100,200,300],5]

100    2227
200    3282
300    3268
Name: no_of_employees, dtype: int64

In [51]:
visa_df.iloc[[100,200,300],[5]]

     no_of_employees
100             2227
200             3282
300             3268

In [52]:
visa_df.iloc[100:106,[5,8,10]]

     no_of_employees  prevailing_wage full_time_position
100             2227         28243.79                  Y
101              334         43421.88                  Y
102              224         80253.78                  Y
103              367        115235.95                  Y
104              306         95200.86                  N
105             2317         41613.52                  Y

In [55]:
np.array([5]).ndim

1

In [56]:
# i want to extract only prevailing wage data
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [57]:
list(visa_df.columns).index('prevailing_wage')

8

In [61]:
visa_df.iloc[[100,200,300],[8]]
visa_df.loc[[100,200,300],['prevailing_wage']]
# using loc we can provide direct names

     prevailing_wage
100         28243.79
200         74441.11
300        101371.21

**how to select the columns**

In [62]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [63]:
visa_df['continent'] # series

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [65]:
visa_df[['continent']] # dataframe

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

In [ ]:
visa_df['continent'] # series
visa_df[['continent']] # dataframe

In [67]:
visa_df[['continent','education_of_employee']]

      continent education_of_employee
0          Asia           High School
1          Asia              Master's
2          Asia            Bachelor's
3          Asia            Bachelor's
4        Africa              Master's
...         ...                   ...
25475      Asia            Bachelor's
25476      Asia           High School
25477      Asia              Master's
25478      Asia              Master's
25479      Asia            Bachelor's

[25480 rows x 2 columns]

In [68]:
visa_df.continent # series

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [69]:
visa_df.loc[:,['continent']]

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

In [70]:
visa_df.loc[:,'continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [ ]:
visa_df['continent'] # series
visa_df.continent    # series
visa_df.loc[:,'continent'] # series

visa_df[['continent']] # Dataframe
visa_df.loc[:,['continent']] # Dataframe